import re

# 1% 2% 5% 10% 20% 50%
DROP_RATE = {
    "lucky": "1/100",
    "orange": "1/50",
    "purple": "1/20",
    "blue": "1/10",
    "green": "1/5",
    "white": "1/2"
}

VARIATION_MAPPER = {
    1: "",
    2: "【一星】",
    3: "【二星】",
    4: "【三星】",
    5: "【四星】",
    6: "【五星】",
    7: "【六星】",
    8: "【七星】",
    9: "【八星】",
    10: "【九星】"
}


POTIONS = {
    "太阳水",
    "强效太阳水",
    "金创药(小量)",
    "金创药(中量)",
    "强效金创药",
    "超级金创药",
    "超强金创药",
    "魔法药(小量)",
    "魔法药(中量)",
    "强效魔法药",
    "超级魔法药",
    "超强魔法药",
}

ZUMA = {
    ""

}
